ch-premchand/TouchGFX_STM32H747_DISCO_Actalent/Actalent_MultiTouchSystem/CM7/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h7xx_hal.h"
#include "string.h"
#include<stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#ifndef HSEM_ID_0
#define HSEM_ID_0 (0U) /* HW semaphore 0*/
#endif
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

JPEG_HandleTypeDef hjpeg;
MDMA_HandleTypeDef hmdma_jpeg_infifo_th;
MDMA_HandleTypeDef hmdma_jpeg_outfifo_th;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

/* Definitions for TouchGFXTask */
osThreadId_t TouchGFXTaskHandle;
const osThreadAttr_t TouchGFXTask_attributes = {
  .name = "TouchGFXTask",
  .stack_size = 3048 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for videoTask */
osThreadId_t videoTaskHandle;
const osThreadAttr_t videoTask_attributes = {
  .name = "videoTask",
  .stack_size = 1000 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* USER CODE BEGIN PV */
OTM8009A_Object_t OTM8009AObj;
OTM8009A_IO_t IOCtx;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_MDMA_Init(void);
static void MX_FMC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_LTDC_Init(void);
static void MX_CRC_Init(void);
static void MX_JPEG_Init(void);
static void MX_USART1_UART_Init(void);
void TouchGFX_Task(void *argument);
extern void videoTaskFunc(void *argument);

/* USER CODE BEGIN PFP */
uint8_t BCD_to_Decimal(uint8_t bcd);
uint8_t Decimal_to_BCD(uint8_t dec);
#define DS1307_ADDR 0xD0  // DS1307 I2C address for RTC (Real Time Clock)

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
HAL_StatusTypeDef RTC_Write(uint8_t reg, uint8_t* data, uint16_t size) {
    // Use BSP I2C write function to write to RTC
    return BSP_I2C4_WriteReg(DS1307_ADDR, reg, data, size);
}
HAL_StatusTypeDef RTC_Read(uint8_t reg, uint8_t* data, uint16_t size) {
    // Use BSP I2C read function to read from RTC
    return BSP_I2C4_ReadReg(DS1307_ADDR, reg, data, size);
}
void Set_Time(uint8_t hours, uint8_t minutes, uint8_t seconds) {
    uint8_t time_data[3];

    // Convert time to BCD and store in time_data array
    time_data[0] = Decimal_to_BCD(seconds);   // Seconds
    time_data[1] = Decimal_to_BCD(minutes);   // Minutes
    time_data[2] = Decimal_to_BCD(hours);     // Hours

    // Write time data to RTC using BSP function
    if (RTC_Write(0x00, time_data, 3) != HAL_OK) {
        // Handle error (e.g., failed to write to RTC)
    }
}

void Get_Time(uint8_t* hours, uint8_t* minutes, uint8_t* seconds) {
    uint8_t time_data[3];

    // Read time data from RTC using BSP function
    if (RTC_Read(0x00, time_data, 3) != HAL_OK) {
        // Handle error (e.g., failed to read from RTC)
    }

    // Convert BCD values to decimal and store in the respective variables
    *seconds = BCD_to_Decimal(time_data[0]);
    *minutes = BCD_to_Decimal(time_data[1]);
    *hours = BCD_to_Decimal(time_data[2]);
}

/**
  * @brief  Convert BCD (Binary Coded Decimal) to Decimal
  * @param  bcd: BCD value
  * @retval Decimal equivalent of BCD value
  */
uint8_t BCD_to_Decimal(uint8_t bcd) {
    return ((bcd >> 4) * 10) + (bcd & 0x0F);  // Extract tens and ones digits
}

/**
  * @brief  Convert Decimal to BCD (Binary Coded Decimal)
  * @param  dec: Decimal value
  * @retval BCD equivalent of Decimal value
  */
uint8_t Decimal_to_BCD(uint8_t dec) {
    return ((dec / 10) << 4) | (dec % 10);  // Convert decimal to BCD
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
/* USER CODE BEGIN Boot_Mode_Sequence_0 */
  int32_t timeout;
/* USER CODE END Boot_Mode_Sequence_0 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

/* USER CODE BEGIN Boot_Mode_Sequence_1 */
  /* Wait until CPU2 boots and enters in stop mode or timeout*/
  timeout = 0xFFFF;
  while((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) != RESET) && (timeout-- > 0));
  if ( timeout < 0 )
  {
  Error_Handler();
  }
/* USER CODE END Boot_Mode_Sequence_1 */
  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

